<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------

    // 视图输出字符串内容替换
    'view_replace_str'  =>  [
            '__PUBLIC__'=>'/admin/',
            '__ROOT__' => '/',
        ],
    //自定义密码加密字符串
    'password_str'=>[',./clock'],
     // 默认跳转页面对应的模板文件
    'dispatch_success_tmpl'  => APP_PATH . 'sbyadmin' . DS . 'view/Public/success.html',
    'dispatch_error_tmpl'    => APP_PATH . 'sbyadmin' . DS . 'view/Public/error.html',
    
    ];
    
  
